<?php
$zarr = array(
    '0' => array(
        'name' => 'Форсунки CAT 3116 № 127-8225',
        'price' => '9850'
    ),
    '1' => array(
        'name' => 'Форсунки CAT 3116 № 107-4091',
        'price' => '9850'
    ),
    '2' => array(
        'name' => 'Форсунки CAT 3116 № 100-6251',
        'price' => '9850'
    ),
    '3' => array(
        'name' => 'Форсунки CAT 3116 № 0R-4376',
        'price' => '9850'
    ),
    '4' => array(
        'name' => 'Форсунки CAT 3116 № 0R-8469',
        'price' => '9850'
    ),
    '5' => array(
        'name' => 'Насос масляный CAT 3116 № 200-4497',
        'price' => '15950'
    ),
    '6' => array(
        'name' => 'Стартер CAT 3116 № 207-1516',
        'price' => '26500'
    ),
    '7' => array(
        'name' => 'Вкладыш коренной CAT 3116 № 7W-9417',
        'price' => '437'
    ),
    '8' => array(
        'name' => 'Вкладыш коренной CAT 3116 № 101-1530',
        'price' => '437'
    ),
    '9' => array(
        'name' => 'Упорный вкладыш CAT 3116 № 212-4893',
        'price' => '1270'
    ),
    '10' => array(
        'name' => 'Упорный вкладыш CAT 3116 № 107-7602',
        'price' => '1270'
    ),
    '11' => array(
        'name' => 'Насос подкачки CAT 3116 № 105-2508',
        'price' => '950'
    ),
    '12' => array(
        'name' => 'Форсунка CAT 3126 № 10R-0781',
        'price' => '21750'
    ),
    '13' => array(
        'name' => 'Форсунка CAT 3116 № 10R-0782',
        'price' => '21950'
    ),
    '14' => array(
        'name' => 'Прокладка ГБЦ CAT 3116 №  111-8015',
        'price' => '1970'
    ),
    '15' => array(
        'name' => 'Прокладка ГБЦ CAT 3116 №  7E-6167',
        'price' => '1970'
    ),
    '16' => array(
        'name' => 'Прокладка ГБЦ CAT 3116 №  7N-7999',
        'price' => '1970'
    ),
    '17' => array(
        'name' => 'Картридж турбокомпрессора CAT 3116 № 118-2032',
        'price' => '39750'
    ),
    '18' => array(
        'name' => 'Фильтр топливный CAT 3116 № 1R-0751',
        'price' => '465'
    ),
    '19' => array(
        'name' => 'Фильтр топливный CAT 3116 № 6i-4783',
        'price' => '465'
    ),
    '20' => array(
        'name' => 'Гидравлический насос управления форсунками CAT 3116 №  180-7341',
        'price' => '55750'
    ),
    '21' => array(
        'name' => 'Фильтр масляный CAT 3116 № 1R-0739',
        'price' => '550'
    ),
    '22' => array(
        'name' => 'Поршневой набор (поршень, палец, поршн.кольца) CAT 3054 C4.4 № 225-5437',
        'price' => '6900'
    ),
    '23' => array(
        'name' => 'Набор поршневых колец CAT 3054  C4.4 № 225-5436',
        'price' => '1659'
    ),
    '24' => array(
        'name' => 'Набор шатунных вкладышей  CAT 3054  C4.4 № 225-7781',
        'price' => '2350'
    ),
    '25' => array(
        'name' => 'Набор коренных вкладышей CAT 3054  C4.4 № 225-7772',
        'price' => '2570'
    ),
    '26' => array(
        'name' => 'Прокладка ГБЦ CAT 3054  C4.4 № 258-4946',
        'price' => '1975'
    ),
    '27' => array(
        'name' => 'Форсунка CAT 3054  C4.4  Perkins 2645K011',
        'price' => '4350'
    ),
    '28' => array(
        'name' => 'Набор прокладок верхний К1  CAT 3054  C4.4',
        'price' => '5400'
    ),
    '29' => array(
        'name' => 'Форсунка CAT 3054  C4.4  Perkins 2645K012',
        'price' => '4350'
    ),
    '30' => array(
        'name' => 'Форсунка CAT 3054  C4.4  Perkins 2645K025',
        'price' => '4350'
    ),
    '31' => array(
        'name' => 'Набор прокладок нижний К2 CAT 3054  C4.4',
        'price' => '5500'
    ),
    '32' => array(
        'name' => 'Фильтр воздушный внешний CAT 3054  C4.4  № 227-7448',
        'price' => '1755'
    ),
    '33' => array(
        'name' => 'Фильтр воздушный внешний CAT 3054  C4.4  № 293-4053',
        'price' => '1755'
    ),
    '34' => array(
        'name' => 'Фильтр масляный CAT 3054  C4.4  № 7W-2326',
        'price' => '345'
    ),
    '35' => array(
        'name' => 'Форсунка CAT 3054  C4.4  № 320-0680',
        'price' => '23750'
    ),
    '36' => array(
        'name' => 'Форсунка CAT 3054  C4.4  № 292-3780',
        'price' => '23750'
    ),
    '37' => array(
        'name' => 'ТНВД CAT 3054  C4.4  № 197-391',
        'price' => '59750'
    ),
    '38' => array(
        'name' => 'Форсунка CAT C7 № 328-2586',
        'price' => '31750'
    ),
    '39' => array(
        'name' => 'Форсунка CAT C7 № 295-1412',
        'price' => '31750'
    ),
    '40' => array(
        'name' => 'Форсунка CAT C7 № 268-1836',
        'price' => '31750'
    ),
    '41' => array(
        'name' => 'Поршень CAT C7 № 238-2720',
        'price' => '9750'
    ),
    '42' => array(
        'name' => 'Поршень CAT C7 № 10R-1930',
        'price' => '9750'
    ),
    '43' => array(
        'name' => 'Поршень CAT C7 № 10R-1929',
        'price' => '9750'
    ),
    '44' => array(
        'name' => 'Поршень CAT C7 № 238-2698',
        'price' => '9750'
    ),
    '45' => array(
        'name' => 'Кольца поршневые  CAT C7 № 238-2706',
        'price' => '1850'
    ),
    '46' => array(
        'name' => 'Кольца поршневые  CAT C7 № 197-9353',
        'price' => '1850'
    ),
    '47' => array(
        'name' => 'Кольца поршневые  CAT C7 № 197-9386',
        'price' => '1850'
    ),
    '48' => array(
        'name' => 'Вкладыш коренной CAT C7 № 107-7708',
        'price' => '455'
    ),
    '49' => array(
        'name' => 'Прокладка ГБЦ CAT C7 № 133-4995',
        'price' => '2375'
    ),
    '50' => array(
        'name' => 'Форсунка CAT C7 № 328-2583',
        'price' => '33970'
    ),
    '51' => array(
        'name' => 'Форсунка CAT C7 № 295-1408',
        'price' => '33970'
    ),
    '52' => array(
        'name' => 'Форсунка CAT C7 № 243-4502',
        'price' => '33970'
    ),
    '53' => array(
        'name' => 'Форсунка CAT C7 № 236-0973',
        'price' => '33970'
    ),
    '54' => array(
        'name' => 'Фильтр масляный CAT C7 №  1R-1807',
        'price' => '537'
    ),
    '55' => array(
        'name' => 'Фильтр масляный  CAT C7 № 1R-1808',
        'price' => '537'
    ),
    '56' => array(
        'name' => 'Водяной насос(водяная помпа) CAT C7 № 236-4413',
        'price' => '14750'
    ),
    '57' => array(
        'name' => 'Форсунка CAT C9 № 10R-7224',
        'price' => '32050'
    ),
    '58' => array(
        'name' => 'Форсунка CAT C9 № 236-0962',
        'price' => '32050'
    ),
    '59' => array(
        'name' => 'Форсунка CAT C9, С7 № 10R-7221',
        'price' => '32350'
    ),
    '60' => array(
        'name' => 'Форсунка CAT C9, С7 № 328-2573',
        'price' => '32350'
    ),
    '61' => array(
        'name' => 'Форсунка CAT C9, С7 № 387-9434',
        'price' => '32350'
    ),
    '62' => array(
        'name' => 'Форсунка CAT C9, С7 № 10R-7222',
        'price' => '33000'
    ),
    '63' => array(
        'name' => 'Форсунка CAT C9, С7 № 387-9433',
        'price' => '33000'
    ),
    '64' => array(
        'name' => 'Форсунка CAT C9, С7 № 328-2574',
        'price' => '33000'
    ),
    '65' => array(
        'name' => 'Форсунка CAT C9, С7 № 10R-7223',
        'price' => '32150'
    ),
    '66' => array(
        'name' => 'Форсунка CAT C9, С7 № 328-2576',
        'price' => '32150'
    ),
    '67' => array(
        'name' => 'Форсунка CAT C9, С7 №  293-4073',
        'price' => '32150'
    ),
    '68' => array(
        'name' => 'Форсунка CAT C9, С7 № 253-4340',
        'price' => '32150'
    ),
    '69' => array(
        'name' => 'Форсунка CAT C9, С7 № 10R-4763',
        'price' => '33550'
    ),
    '70' => array(
        'name' => 'Форсунка CAT C9, С7 № 328-2582',
        'price' => '33550'
    ),
    '71' => array(
        'name' => 'Форсунка CAT C9, С7 № 387-9428',
        'price' => '33550'
    ),
    '72' => array(
        'name' => 'Форсунка CAT C9, С7 № 295-1410',
        'price' => '33550'
    ),
    '73' => array(
        'name' => 'Форсунка CAT C9, С7 № 241-3400',
        'price' => '33550'
    ),
    '74' => array(
        'name' => 'Форсунка CAT C9, С7 № 236-0974',
        'price' => '33550'
    ),
    '75' => array(
        'name' => 'Форсунка CAT C9, С7 № 238-8091',
        'price' => '33550'
    ),
    '76' => array(
        'name' => 'Форсунка CAT C9, С7 № 222-5962',
        'price' => '33550'
    ),
    '77' => array(
        'name' => 'Форсунка CAT C9, С7 № 243-4503',
        'price' => '33550'
    ),
    '78' => array(
        'name' => 'Набор поршневых колец CAT C9 № 197-9297+168-7209+161-3425',
        'price' => '2950'
    ),
    '79' => array(
        'name' => 'Прокладка ГБЦ CAT C9 № 187-1315',
        'price' => '2960'
    ),
    '80' => array(
        'name' => 'Фильтр топливный CAT C9 №1R-0749',
        'price' => '635'
    ),
    '81' => array(
        'name' => 'Прокладка ГБЦ CAT С10 № 187-3307',
        'price' => '3785 '
    ),
    '82' => array(
        'name' => 'Поршень CAT С15 № 232-6557',
        'price' => '16500'
    ),
    '83' => array(
        'name' => 'Палец поршня CAT С15 № 180-7350',
        'price' => '2457'
    ),
    '84' => array(
        'name' => 'Вкладыш коренной STD CAT С15 № 4W-5492/317-8766',
        'price' => '1350'
    ),
    '85' => array(
        'name' => 'Вкладыш коренной STD CAT С15 № 317-8766',
        'price' => '1350'
    ),
    '86' => array(
        'name' => 'Вкладыш шатунный CAT С15 № 224-3246',
        'price' => '1385'
    ),
    '87' => array(
        'name' => 'Клапан впускной  CAT С15 № 153-7023',
        'price' => '1450'
    ),
    '88' => array(
        'name' => 'Клапан выпускной CAT С15 № 153-7024',
        'price' => '1450'
    ),
    '89' => array(
        'name' => 'Прокладка ГБЦ CAT С15 № 224-5122',
        'price' => '4503'
    ),
    '90' => array(
        'name' => 'Насос подкачки CAT С15 № 137-5541 / 4N-9625',
        'price' => '1100'
    ),
    '91' => array(
        'name' => 'Насос подкачки CAT С15 № 4N-9625',
        'price' => '1100'
    ),
    '92' => array(
        'name' => 'Насос-форсунка CAT С15 № 10R-3264',
        'price' => '31350'
    ),
    '93' => array(
        'name' => 'Насос-форсунка CAT С15 № 253-0615',
        'price' => '31350'
    ),
    '94' => array(
        'name' => 'Насос-форсунка CAT С15 № 244-7715',
        'price' => '31350'
    ),
    '95' => array(
        'name' => 'Набор поршневой (поршень, палец, стопорные кольца) CAT 3066 № 297-7750Р',
        'price' => '2970'
    ),
    '96' => array(
        'name' => 'Шатун CAT 3066 № 5i-7668',
        'price' => '4150'
    ),
    '97' => array(
        'name' => 'Набор вкладышей коренных CAT 3066 № 5i-7588',
        'price' => '360'
    ),
    '98' => array(
        'name' => 'Набор вкладышей коренных CAT 3066 №  4i-9213',
        'price' => '360'
    ),
    '99' => array(
        'name' => 'Набор вкладышей шатунных CAT 3066 № 5i-7637 / 096-9534',
        'price' => '335'
    ),
    '100' => array(
        'name' => 'Набор вкладышей шатунных CAT 3066 № 096-9534',
        'price' => '335'
    ),
    '101' => array(
        'name' => 'Гильза CAT 3066 № 5i-7523',
        'price' => '1450'
    ),
    '102' => array(
        'name' => 'Гильза CAT 3066 № 085-8822',
        'price' => '1450'
    ),
    '103' => array(
        'name' => 'Набор поршневых колец CAT 3066 № 178-6543',
        'price' => '955'
    ),
    '104' => array(
        'name' => 'Маслосъемный колпачок CAT 3066 № 5i-7624',
        'price' => '65'
    ),
    '105' => array(
        'name' => 'Поршень CAT 3306 № 165-4262',
        'price' => '3650'
    ),
    '106' => array(
        'name' => 'Поршень CAT 3306 № 168-4531',
        'price' => '3650'
    ),
    '107' => array(
        'name' => 'Палец поршневой CAT 3306 №  7N-9805',
        'price' => '950'
    ),
    '108' => array(
        'name' => 'Набор колец поршневых CAT 3306 № 2W-1709',
        'price' => '1150'
    ),
    '109' => array(
        'name' => 'Коленвал CAT 3306 № 2W-7458',
        'price' => '76500'
    ),
    '110' => array(
        'name' => 'Коленвал CAT 3306 № 334-8389',
        'price' => '76500'
    ),
    '111' => array(
        'name' => 'Коленвал CAT 3306 № 4P-9857',
        'price' => '76500'
    ),
    '112' => array(
        'name' => 'Коленвал CAT 3306 №  344-2603',
        'price' => '76500'
    ),
    '113' => array(
        'name' => 'Вкладыш коренной CAT 3306 № 232-3233',
        'price' => '560'
    ),
    '114' => array(
        'name' => 'Вкладыш коренной CAT 3306 № 4W-5738',
        'price' => '560'
    ),
    '115' => array(
        'name' => 'Вкладыш шатунный CAT 3306 № 328-5572',
        'price' => '553'
    ),
    '116' => array(
        'name' => 'Вкладыш шатунный CAT 3306 № 4W-5739',
        'price' => '553'
    ),
    '117' => array(
        'name' => 'Вкладыш шатунный CAT 3306 № 8N-8220',
        'price' => '553'
    ),
    '118' => array(
        'name' => 'Сальник коленвала задний CAT 3306 № 4W-0452',
        'price' => '1100'
    ),
    '119' => array(
        'name' => 'Передний сальник коленвала CAT 3306 № 9Y-9895',
        'price' => '550'
    ),
    '120' => array(
        'name' => 'Прокладка ГБЦ CAT 3306 № 111-8015',
        'price' => '1900'
    ),
    '121' => array(
        'name' => 'Прокладка ГБЦ CAT 3306 № 7E-6167',
        'price' => '1900'
    ),
    '122' => array(
        'name' => 'Прокладка ГБЦ CAT 3306 № 7N-7999',
        'price' => '1900'
    ),
    '123' => array(
        'name' => 'Форсунка CAT 3406, 3408 №7W-7026',
        'price' => '3200'
    ),
    '124' => array(
        'name' => 'Форсунка CAT 3306 № 8N-7005',
        'price' => '2800'
    ),
    '125' => array(
        'name' => 'Форсунка CAT C15 № 10R-8502',
        'price' => '33000'
    ),
    '126' => array(
        'name' => 'Форсунка CAT C15 № 10R-8501',
        'price' => '33000'
    ),
    '127' => array(
        'name' => 'Форсунка CAT C15 № 10R-2781',
        'price' => '33000'
    ),
    '128' => array(
        'name' => 'Форсунка CAT C15 №  211-3024',
        'price' => '33000'
    ),
    '129' => array(
        'name' => 'Форсунка CAT C15 № 118-9035',
        'price' => '33000'
    ),
    '130' => array(
        'name' => 'Форсунка CAT C15 № 191-3003',
        'price' => '33000'
    ),
    '131' => array(
        'name' => 'Масляный насос CAT 3306 № 6i-1346',
        'price' => '12950'
    ),
    '132' => array(
        'name' => 'Плунжерная пара CAT 3306 № 4p-9830',
        'price' => '6200'
    ),
    '133' => array(
        'name' => 'Поршень Komatsu 6D170 № 6162-35-2120',
        'price' => '19500'
    ),
    '134' => array(
        'name' => 'Водяной насос для двигателей Komatsu 6D108 № 6222-63-1200',
        'price' => '15900'
    ),
    '135' => array(
        'name' => 'Масляный насос Komatsu 6D114 № 6742-01-5201',
        'price' => '6950'
    ),
    '136' => array(
        'name' => 'Водяной насос для двигателей Komatsu 6D114 № 6743-61-1531',
        'price' => '7250'
    ),
    '137' => array(
        'name' => 'Поршень Komatsu 6D140 № 6211-32-2130',
        'price' => '11750 '
    ),
    '138' => array(
        'name' => 'Поршень Komatsu 6D155  № 6128-31-2140',
        'price' => '5550'
    ),
    '139' => array(
        'name' => 'Поршень Komatsu 6D125 № 6151-32-2110',
        'price' => '3750'
    ),
    '140' => array(
        'name' => 'Шатун в  сборе  Komatsu 6D125  № 6151-31-3101',
        'price' => '12750'
    ),
    '141' => array(
        'name' => 'Поршень Komatsu 6D114  № 6743-31-2110',
        'price' => '2350'
    ),
    '142' => array(
        'name' => 'Поршень Komatsu 6D108  № 6221-31-2110',
        'price' => '3350'
    ),
    '143' => array(
        'name' => 'Поршень  Komatsu 4D102 № 6735-31-2111/6738-31-2110',
        'price' => '2150'
    ),
    '144' => array(
        'name' => 'Поршень  Komatsu 4D102 № 6738-31-2110',
        'price' => '2150'
    ),
    '145' => array(
        'name' => 'Поршень  Komatsu 6D102 № 6735-31-2111/6738-31-2110',
        'price' => '2150'
    ),
    '146' => array(
        'name' => 'Поршень  Komatsu 6D102 № 6738-31-2110',
        'price' => '2150'
    ),
    '147' => array(
        'name' => 'Набор поршневой Cummins ISX 15 № 4089895',
        'price' => '17750'
    ),
    '148' => array(
        'name' => 'Набор поршневой Cummins QSX15 № 4089895',
        'price' => '17750'
    ),
    '149' => array(
        'name' => 'Набор поршневой: поршень со стопорными кольцами, палец, поршневые кольца Cummins M11  № 4025161',
        'price' => '14750'
    ),
    '150' => array(
        'name' => 'Набор поршневой: поршень со стопорными кольцами, палец, поршневые кольца Cummins L10  № 4025161',
        'price' => '14750'
    ),
    '151' => array(
        'name' => 'Набор поршневой: поршень, палец, поршневые кольца Komatsu 6D107  № 6754-32-2110',
        'price' => '3725'
    )
);
?>
